code-review/NRB_3471_3546/База_Было/Catalogs/КлассификаторРегионов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>КлассификаторРегионов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодОКАТО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодДляОтчетов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодДляОтчетов6406У</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодКЛАДР</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодФИАС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеФИАС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Catalogs/КлассификаторРегионов/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Заполняет справочник значениями по умолчанию из макета "Регионы"
Процедура ЗаполнитьКлассификаторЗначениямиПоУмолчанию() Экспорт
	
	Макет = Справочники.КлассификаторРегионов.ПолучитьМакет("Регионы");
	
	КоличествоСтрок = Макет.ВысотаТаблицы;
	
	ТаблицаДанныхПоРегионам = Новый ТаблицаЗначений;
	ТаблицаДанныхПоРегионам.Колонки.Добавить("Наименование");
	ТаблицаДанныхПоРегионам.Колонки.Добавить("КодОКАТО");
	ТаблицаДанныхПоРегионам.Колонки.Добавить("КодКЛАДР");
	ТаблицаДанныхПоРегионам.Колонки.Добавить("КодФИАС");
	ТаблицаДанныхПоРегионам.Колонки.Добавить("НаименованиеФИАС");
	
	Для НомерСтрокиМакета = 2 По КоличествоСтрок Цикл
		НоваяСтрока = ТаблицаДанныхПоРегионам.Добавить();
		НоваяСтрока.Наименование 		= СокрЛП(Макет.Область("R" + НомерСтрокиМакета + "C1").Текст);
		НоваяСтрока.КодОКАТО 			= СокрЛП(Макет.Область("R" + НомерСтрокиМакета + "C2").Текст);
		НоваяСтрока.КодКЛАДР 			= СокрЛП(Макет.Область("R" + НомерСтрокиМакета + "C3").Текст);
		НоваяСтрока.КодФИАС 			= СокрЛП(Макет.Область("R" + НомерСтрокиМакета + "C4").Текст);
		НоваяСтрока.НаименованиеФИАС 	= СокрЛП(Макет.Область("R" + НомерСтрокиМакета + "C5").Текст);
	КонецЦикла;
	
	Для каждого Данные Из ТаблицаДанныхПоРегионам Цикл
		СоздатьЗаполнитьЭлементКлассификатораРегионов(Данные.Наименование, Данные.КодОКАТО, Данные.КодКЛАДР,
														Данные.КодФИАС, Данные.НаименованиеФИАС);
	КонецЦикла;

КонецПроцедуры

// Процедура пытается презаполнить реквизит РегионДляОтчетов у всех контрагентов, связанных с указнным
// юридческим/физическим лицом.
// Параметры:
//	ЮридическоеФизическоеЛицо - СправочникСсылка.ЮридическоеЛицо, СправочникСсылка.ФизическоеЛицо
//	РегионИСтрана - Структура - со свойствами Регион (СправочникСсылка.КлассификаторРегионов, Неопределено)
//											и Страна (СправочникСсылка.КлассификаторСтранМира, Неопределено)
//	КромеКонтрагента - СправочникСсылка.Контрагент
//	СообщатьОНеудачеВсегда - Булево
Процедура УстановитьРегионДляКонтрагентов(ЮридическоеФизическоеЛицо, РегионИСтрана = Неопределено,
												КромеКонтрагента = Неопределено, СообщатьОНеудачеВсегда = Ложь) Экспорт
	Если РегионИСтрана = Неопределено Тогда
		РегионИСтрана = РегионЮридическогоФизическогоЛица(ЮридическоеФизическоеЛицо);
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Контрагент,
	|	Контрагенты.РегионДляОтчетов КАК РегионДляОтчетов,
	|	Контрагенты.РегионДляОтчетовРучнойВвод КАК РегионДляОтчетовРучнойВвод,
	|	Контрагенты.Резидент КАК НеРезидент
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.ЮридическиеФизическиеЛица = &ЮридическоеФизическоеЛицо
	|	И НЕ Контрагенты.ПометкаУдаления
	|	И НЕ Контрагенты.РегионДляОтчетовРучнойВвод
	|	И Контрагенты.Ссылка <> &КромеКонтрагента";
	Запрос.УстановитьПараметр("ЮридическоеФизическоеЛицо", ЮридическоеФизическоеЛицо);
	Запрос.УстановитьПараметр("КромеКонтрагента", КромеКонтрагента);
	Запрос.УстановитьПараметр("", РегионИСтрана.Регион);
	Запрос.УстановитьПараметр("", РегионИСтрана.Страна);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		РегионДляОтчетов = РегионДляКонтрагента(РегионИСтрана, Выборка.НеРезидент);
		Если Выборка.РегионДляОтчетов <> РегионДляОтчетов Или (СообщатьОНеудачеВсегда И РегионДляОтчетов = Неопределено) Тогда
			УстановитьРегионДляОтчетовКонтрагенту(Выборка.Контрагент, РегионДляОтчетов, Выборка.НеРезидент, ЮридическоеФизическоеЛицо);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// Функция возвращает ссылку на регион для контрагента
// Параметры:
//	РегионИСтрана - Структура - со свойствами Регион (СправочникСсылка.КлассификаторРегионов, Неопределено)
//											и Страна (СправочникСсылка.КлассификаторСтранМира, Неопределено)
//	НерезидентПоДокументам - Булево - нерезидент по документам (в справочнике Контрагентов это реквизит издевательски
//							названный Резидент).
// Возвращаемое значение:
//	- СправочникСсылка.КлассификаторСтранМира, СправочникСсылка.КлассификаторРегионов, Неопределено
Функция РегионДляКонтрагента(РегионИСтрана, НерезидентПоДокументам) Экспорт
	Если НерезидентПоДокументам Тогда
		Регион = РегионИСтрана.Страна;
	Иначе
		Регион = РегионИСтрана.Регион;
	КонецЕсли;
		
	Возврат Регион;
КонецФункции

// Процедура заполнет всем контрагентам из группы Депоненты реквизит РегионДляОтчетов
Процедура УстановитьДепонентамИВсемНерезидентамРегионДляОтчетов() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	// Также важно что реквизит Резидент в справочнике контрагентов, как это ни парадоксально, означает "Нерезидент по документам"
	// - живите теперь с этим, если не знали раньше
	"ВЫБРАТЬ
	|	Контрагенты.ЮридическиеФизическиеЛица КАК Лицо,
	|	МАКСИМУМ(Контрагенты.Резидент) КАК НеРезидентПоДокументам
	|ПОМЕСТИТЬ ВТ_ЮрФизЛицаДепонентов
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.РегионДляОтчетов = НЕОПРЕДЕЛЕНО
	|	И НЕ Контрагенты.РегионДляОтчетовРучнойВвод
	|	И НЕ Контрагенты.ЮридическиеФизическиеЛица = НЕОПРЕДЕЛЕНО
	|	И ВЫБОР
	|			КОГДА Контрагенты.Родитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.Депоненты)
	|				ТОГДА ИСТИНА
	|			КОГДА Контрагенты.Родитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.Эмитенты)
	|				ТОГДА ИСТИНА
	|			КОГДА Контрагенты.Резидент
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	Контрагенты.ЮридическиеФизическиеЛица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ЮрФизЛицаДепонентов.Лицо КАК ЮридическоеФизическоеЛицо
	|ИЗ
	|	ВТ_ЮрФизЛицаДепонентов КАК ВТ_ЮрФизЛицаДепонентов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|		ПО (КонтактнаяИнформация.Объект = ВТ_ЮрФизЛицаДепонентов.Лицо)
	|			И (КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	|			И НЕ ВТ_ЮрФизЛицаДепонентов.НеРезидентПоДокументам
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ЮрФизЛицаДепонентов.Лицо КАК ЮридическоеФизическоеЛицо
	|ИЗ
	|	ВТ_ЮрФизЛицаДепонентов КАК ВТ_ЮрФизЛицаДепонентов
	|ГДЕ
	|	ВТ_ЮрФизЛицаДепонентов.НеРезидентПоДокументам
	|";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		УстановитьРегионДляКонтрагентов(Выборка.ЮридическоеФизическоеЛицо, , , Истина);
	КонецЦикла;
	
КонецПроцедуры

// Функция определяет можно ли по данной контактной информации попытаться определить регион Объекта
// Параметры:
//	Запись - РегистрСведенийЗапись.КонтактнаяИнформация
// Возвращаемое значение:
//	- Булево
Функция МожноОпределитьРегионПоКонтактнойИнформации(Запись) Экспорт
	МожноОпределитьРегион = Ложь;
	
	Если Запись.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес Тогда
		ТипЗначенияОбъекта = ТипЗнч(Запись.Объект);
		МожноОпределитьРегионДляЮрЛица = ТипЗначенияОбъекта = Тип("СправочникСсылка.ЮридическиеЛица")
										И Запись.Вид = Справочники.ВидыКонтактнойИнформации.ЮрАдресЮрЛица
										И Не Справочники.Контрагенты.ЯвляетсяЭмитентом(Запись.Объект);
		МожноОпределитьРегионДляФизЛица = ТипЗначенияОбъекта = Тип("СправочникСсылка.ФизическиеЛица")
										И Запись.Вид = Справочники.ВидыКонтактнойИнформации.ЮрАдресФизЛица;
		МожноОпределитьРегион = МожноОпределитьРегионДляЮрЛица Или МожноОпределитьРегионДляФизЛица;
	КонецЕсли;
	
	Возврат МожноОпределитьРегион;
КонецФункции

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Функция РегионЮридическогоФизическогоЛица(ЮридическоеФизическоеЛицо) Экспорт
	Результат = Новый Структура("Страна, Регион");
	
	Запрос = Новый Запрос;
	Если ТипЗнч(ЮридическоеФизическоеЛицо) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		Запрос.Текст = ТекстЗапросаОпределяющегоРегионДляФизЛица();
	Иначе
		Запрос.Текст = ТекстЗапросаОпределяющегоРегионДляЮрЛица();
	КонецЕсли;
	Запрос.УстановитьПараметр("ЮридическоеФизическоеЛицо", ЮридическоеФизическоеЛицо);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Если ЗначениеЗаполнено(Выборка.Страна) Тогда
			Результат.Страна = Выборка.Страна;
		КонецЕсли;
		Если ЗначениеЗаполнено(Выборка.Регион) Тогда
			Результат.Регион = Выборка.Регион;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Процедура СоздатьЗаполнитьЭлементКлассификатораРегионов(Наименование, КодОКАТО, КодКЛАДР, КодФИАС, НаименованиеФИАС)
	
	НайденнаяСсылка = Справочники.КлассификаторРегионов.НайтиПоНаименованию(Наименование);
	
	Если НайденнаяСсылка.Пустая() Тогда
		СпрОбъект = Справочники.КлассификаторРегионов.СоздатьЭлемент();
		СпрОбъект.Наименование = Наименование;
	Иначе 
		СпрОбъект = НайденнаяСсылка.ПолучитьОбъект();
	КонецЕсли;
	
	СпрОбъект.КодКЛАДР 				= КодКЛАДР;
	СпрОбъект.КодОКАТО			 	= КодОКАТО;
	СпрОбъект.КодФИАС			 	= КодФИАС;
	СпрОбъект.НаименованиеФИАС		= НаименованиеФИАС;
	СпрОбъект.КодДляОтчетов			= Лев(КодОКАТО, 2);
	СпрОбъект.Записать();
	
КонецПроцедуры

Функция ТекстЗапросаОпределяющегоРегионДляФизЛица()
	Текст =
	"ВЫБРАТЬ
	|	1 КАК Поле
	|ПОМЕСТИТЬ ВТ_ОсноваДляСоединения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ГражданствоФизЛицСрезПоследних.Страна КАК Страна
	|ПОМЕСТИТЬ ВТ_Гражданство
	|ИЗ
	|	РегистрСведений.ГражданствоФизЛиц.СрезПоследних(, ФизЛицо = &ЮридическоеФизическоеЛицо) КАК ГражданствоФизЛицСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтактнаяИнформацияСрезПоследних.Поле2 КАК Поле2
	|ПОМЕСТИТЬ ВТ_КонтактнаяИнформация
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация.СрезПоследних(
	|			,
	|			Объект = &ЮридическоеФизическоеЛицо
	|				И Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
	|				И Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресФизЛица)) КАК КонтактнаяИнформацияСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(КлассификаторРегионов.Ссылка) КАК Регион
	|ПОМЕСТИТЬ ВТ_Регион
	|ИЗ
	|	ВТ_КонтактнаяИнформация КАК ВТ_КонтактнаяИнформация
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлассификаторРегионов КАК КлассификаторРегионов
	|		ПО (ВЫБОР
	|				КОГДА ВТ_КонтактнаяИнформация.Поле2 = КлассификаторРегионов.НаименованиеФИАС
	|					ТОГДА ИСТИНА
	|				КОГДА ВТ_КонтактнаяИнформация.Поле2 = КлассификаторРегионов.Наименование
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|			И (НЕ КлассификаторРегионов.ПометкаУдаления)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Гражданство.Страна КАК Страна,
	|	ВТ_Регион.Регион КАК Регион
	|ИЗ
	|	ВТ_ОсноваДляСоединения КАК ВТ_ОсноваДляСоединения
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Гражданство КАК ВТ_Гражданство
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Регион КАК ВТ_Регион
	|		ПО (ИСТИНА)";
	
	Возврат Текст;
КонецФункции

Функция ТекстЗапросаОпределяющегоРегионДляЮрЛица()
	Текст =
	"ВЫБРАТЬ
	|	КонтактнаяИнформацияСрезПоследних.Поле2 КАК Поле2
	|ПОМЕСТИТЬ ВТ_КонтактнаяИнформация
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация.СрезПоследних(
	|			,
	|			Объект = &ЮридическоеФизическоеЛицо
	|				И Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
	|				И Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресЮрЛица)) КАК КонтактнаяИнформацияСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(КлассификаторРегионов.Ссылка) КАК Регион
	|ПОМЕСТИТЬ ВТ_Регион
	|ИЗ
	|	ВТ_КонтактнаяИнформация КАК ВТ_КонтактнаяИнформация
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлассификаторРегионов КАК КлассификаторРегионов
	|		ПО (ВЫБОР
	|				КОГДА ВТ_КонтактнаяИнформация.Поле2 = КлассификаторРегионов.НаименованиеФИАС
	|					ТОГДА ИСТИНА
	|				КОГДА ВТ_КонтактнаяИнформация.Поле2 = КлассификаторРегионов.Наименование
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|			И (НЕ КлассификаторРегионов.ПометкаУдаления)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЮридическиеЛица.Страна КАК Страна,
	|	ВТ_Регион.Регион КАК Регион
	|ИЗ
	|	Справочник.ЮридическиеЛица КАК ЮридическиеЛица
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Регион КАК ВТ_Регион
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ЮридическиеЛица.Ссылка = &ЮридическоеФизическоеЛицо";
	
	Возврат Текст;
КонецФункции

Процедура УстановитьРегионДляОтчетовКонтрагенту(Контрагент, Регион, НеРезидент, ЮридическоеФизическоеЛицо)
	Если Не ЗначениеЗаполнено(Регион) Тогда
		ИмяСобытия = "Получение значения для заполнения реквизита ""РегионДляОтчетов"" в справочнике ""Депоненты/Контрагенты""";
		ТекстСообщения = "Не удалось определить код региона для контрагента " + Строка(Контрагент)
						+ " (юридическое/физическое лицо: " + Строка(ЮридическоеФизическоеЛицо) + ")";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.КлассификаторРегионов, 
									ЮридическоеФизическоеЛицо, ТекстСообщения);
	Иначе
		КонтрагентОбъект = Контрагент.ПолучитьОбъект();
		КонтрагентОбъект.РегионДляОтчетов = Регион;
		КонтрагентОбъект.ОбменДанными.Загрузка = Истина;
		Попытка
			КонтрагентОбъект.Записать();
		Исключение
			Сообщение = "При попытке заполнения реквизита ""Регион для отчетов"" не удалось записать элемент справочника Контрагенты "
						+ Строка(Контрагент) + " по причине: " +  ОписаниеОшибки();
			ВызватьИсключение(Сообщение);
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
